[{"Title": "Work from Home - Customer Service Representative - Charlotte", "Company": "iQor", "Description": "Work from Home. Customer Service Representative. Charlotte. LocationNorth Carolina, North Carolina. Job typeFull time. We are seeking Customer Service Representatives to assist our clients.."}, {"Title": "Intern - Management Consulting (Charlotte, NC, Cincinnati, OH or Remote)", "Company": "Raftelis", "Description": "Company Description. Raftelis helps local governments and utilities thrive by providing management consulting expertise to help transform local governments and utilities. Weve pro.."}, {"Title": "Audit Manager - Charlotte (Hybrid or Remote)", "Company": "Cherry Bekaert LLP", "Description": "If these values align with yours, wed like to hear from you. Lets grow your career as an Audit Manager in our Charlotte, NC, practice. What your day looks like. Communicating between clients.."}, {"Title": "Public Relations Senior Account Executive (B2B Tech or Healthcare) Remote, Charlotte", "Company": "HighwirePR", "Description": "About us. Highwire Public Relations is a modern communications agency designed for disruptive companies. As the top ranked independent tech and healthcare PR firm, we represent som.."}, {"Title": "IT Sales Executive - Fully Remote - Charlotte", "Company": "Magna5 MS LLC", "Description": "Description. Remote position. Must be eligible to work in the United States. This role would be supporting efforts in the Charlotte region. Some in person visits at clients within the Charlotte.."}, {"Title": "Sr Admin Assistant - REMOTE in Charlotte, Linden, East Hartford, NYC, or Boston only", "Company": "CBRE", "Description": "Sr Admin Assistant. REMOTE in Charlotte, Linden, East Hartford, NYC, or Boston only Job ID 76384 Posted.. Massachusetts. United States of America, Charlotte. North Carolina. United States of America, East.."}, {"Title": "Cloud FinOps Engineer(Remote) - Charlotte, NC area ONLY", "Company": "Fidelity Investments", "Description": "While the position is remote, you are required to live in the Charlotte, NC area. Youll have full access to virtual training and learning opportunities, plus dynamic working resources to help.."}, {"Title": "Splunk Analyst.-Charlotte NC- remote for now", "Company": "Georgia IT Inc.", "Description": "Splunk Analyst. Charlotte NC. remote for now. Contract. U.S. Citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor currently. Skills. At least.."}, {"Title": "Senior Java Developer - Charlotte, NC (Remote)", "Company": "Diverse Lynx", "Description": "Role. Senior Java Developer Location. Charlotte, NC (Remote until COVID is over). 1. Experience in developing Microservices 2. Experience in Oracle, Rest APIs, Spring and Spring Boot Framework 3.."}, {"Title": "Remote Scheduler", "Company": "Kitchen Tune-Up Charlotte, NC", "Description": "Charlotte area company is seeking an experienced Schedule Coordinator with residential kitchen and bathroom remodeling experience. We are a growing remodeling business and have a g.."}, {"Title": "Account Lead, Data/Analytics Sales (Charlotte/ Remote)", "Company": "BlueGranite", "Description": "Why youre here You enjoy building relationships and being a part of fast paced, exciting, and impactful data initiatives, but the work life balance of a typical business developmen.."}, {"Title": "Senior Product Manager (Personal Lines Insurance) - Charlotte, NC - Remote", "Company": "UPC Insurance", "Description": "Senior Product Manager (Personal Lines Insurance). Charlotte, NC. Remote Job Locations US NC Charlotte Overview Summary. The Senior Product Manager is responsible for meeting company premium and.."}, {"Title": "Remote Account Executive - Charlotte", "Company": "StaffWorks, Inc.", "Description": "REMOTE ACCOUNT EXECUTIVE OPPORTUNITY. CHARLOTTE, NC!. Our client is a leading healthcare payment and premium processing company. They focus on payment solutions at point of care in the.."}, {"Title": "Sr Admin Assistant - REMOTE in Charlotte, Linden, East Hartford, NYC, or Boston only", "Company": "CBRE Argentina", "Description": "ESSENTIAL DUTIES AND RESPONSIBILITIES Performs administrative duties such as conducting research, updating and maintaining databases, preparing company forms and maintaining confid.."}, {"Title": "Area Sales Executive (Charlotte)", "Company": "Western Union", "Description": "Area Sales Executive. Charlotte, NC (Work from home)Are you a motivated sales individual who enjoys being face to face with your customers?. Do you enjoy building a strong network, meeting.."}, {"Title": "Customer Technical Support I - Charlotte, NC; Open to Remote", "Company": "Computer Services, Inc", "Description": "Customer Technical SupportLocation. Preferred Charlotte, NC. Open to any CSI Office. Open to Remote on a case by case analysisJOB SUMMARYCustomer Technical Support positions field front line.."}, {"Title": "19 - 38168 - Remote till covid :: Looking for Java developer:: Charlotte, NC :: 10 Months", "Company": "Oloop Technology Solutions", "Description": "Overview Java Lead Charlotte, NC 10 months contract Remote until the covid situation is over. 8 or more years of relevant work experience using OOM, preferable Java 2. Experience with Camel.."}, {"Title": "Customer care representative in Charlotte, NC (Remote) at $15 an hour", "Company": "InfiCare Technologies", "Description": "div ccp infra copy id \"\" ccp infra timestamp \"1659029135291\" ccp infra user hash \"4015443928\" ccp infra version \"3\" data ccp timestamp \"1659029135291\". div. table style \"border col.."}, {"Title": "Sr. Manager, Vulnerability & Threat Management (Charlotte, NC or Corning, NY or Remote)", "Company": "Corning", "Description": "Requisition Number. 56405 Corning is one of the worlds leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialt.."}, {"Title": "Tax Accountant (Charlotte, NC (Hybrid) or Fully Remote)", "Company": "Brighthouse Financial", "Description": "Req Id. 4082Job location. Charlotte, NC, US, 28277Tax AccountantReq ID. 4082Where youll work Our hybrid.. This is a remote position with a hybrid option for candidates based in Charlotte, NC.How youll.."}, {"Title": "Java Developer (Day 1 onsite in hybrid mode, 3 days office and 3 days WFH)/ Charlotte, NC", "Company": "MTK Technologies", "Description": "Div. div. div Role. Java Developer. br. Location. Charlotte, NC (Day 1 onsite in hybrid mode). br. Contract Duration. 12. Month Contact with Possible extension. div. div. div. div Job.."}, {"Title": "Account Manager-Charlotte (Remote)", "Company": "CommScope Inc.", "Description": "This role covers Western North Carolina with the ideal candidate being in the Charlotte, NC area. How Youll Help Us Connect the World.Its not very often you get a chance to connect with.."}, {"Title": "Strategic Insights Manager- Charlotte, NC or Remote, US", "Company": "Dentsply Sirona", "Description": "Dentsply Sironas global headquarters is located in Charlotte, North Carolina. The companys shares are.. This role can be in office at our Headquarters in Charlotte, NC, hybrid, or remote (within the US) work.."}, {"Title": "REMOTE - Identity Cloud Engineer (Charlotte)", "Company": "CIBC", "Description": "This remote position will be located in the Charlotte, NC area.How Youll SucceedLeadership. Provide technical leadership and best practices to infrastructure teams. Build strong relationships.."}, {"Title": "Technical Account Manager | Raleigh or Charlotte, NC - Opportunity for Working Remotely", "Company": "myGwork", "Description": "LOCATION. Candidates must live in near Raleigh or Charlotte, NC. TECHNICAL ACCOUNT MANAGER The Elevator.. Candidates must live in or near Raleigh or Charlotte, NC with the ability to travel up to 30. regionally.."}, {"Title": "Advanced Practical Registered Nurse (APRN) – Great FT Opportunity! Blended Office/Remote – OP Med $4000 Sign on Bonus", "Company": "Charlotte Behavioral Health Care", "Description": "Why Charlotte Behavioral Health Care? Charlotte Behavioral Health Care is the premier mental health.. We are located in charming Punta Gorda, FL. a hidden treasure on Charlotte Harbor.Centrally located.."}]